## Plan for org_account/main
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| add    | `aws_organizations_policy.cds_snc_universal_guardrails`                    |
|        | `aws_organizations_policy_attachment.Sandbox-cds_snc_universal_guardrails` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_policy.cds_snc_universal_guardrails will be created
  + resource "aws_organizations_policy" "cds_snc_universal_guardrails" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "redshift:*",
                          + "redshift-serverless:*",
                          + "redshift-data:*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "BlockRedshift"
                    },
                  + {
                      + Action   = "sagemaker:*"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "BlockSageMaker"
                    },
                  + {
                      + Action    = "sns:DeleteTopic"
                      + Condition = {
                          + ArnNotLike = {
                              + aws:PrincipalArn = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:sns:*:*:internal-sre-alert"
                      + Sid       = "ProtectInternalSreAlertTopic"
                    },
                  + {
                      + Action   = "iam:CreateAccessKey"
                      + Effect   = "Deny"
                      + Resource = [
                          + "arn:aws:iam::*:user/ops2",
                          + "arn:aws:iam::*:user/ops1",
                        ]
                      + Sid      = "DoNotAllowIAMKeysOnOpsUsers"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "CDS-SNC Universal Guardrails"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.Sandbox-cds_snc_universal_guardrails will be created
  + resource "aws_organizations_policy_attachment" "Sandbox-cds_snc_universal_guardrails" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-qhvjdryl"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cds_sentinel_securityhub_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.azure_sentinel"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.AFT"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.DumpsterFire"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Production"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.SRETools"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Security"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Test"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.cds_snc_universal_guardrails"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.cloudtrail_sqs_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN -...
```

</details>
